<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2

In [2]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [3]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [4]:
# текст запроса
query_3_1 = f'''select count(id)
           FROM public.vacancies
        '''
df = pd.read_sql_query(query_3_1, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\980877723.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

In [5]:
# результат запроса
df

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [6]:
# текст запроса
query_3_2 = f'''select count(id)
           FROM public.EMPLOYERS
        '''
df = pd.read_sql_query(query_3_2, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\765261593.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

In [7]:
# результат запроса
df

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [8]:
# текст запроса
# текст запроса
query_3_3 = f'''select count(id)
           FROM public.areas
        '''
df = pd.read_sql_query(query_3_3, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\4121801418.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

In [9]:
# результат запроса
df

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [10]:
# текст запроса
query_3_4 = f'''select count(id)
           FROM public.industries
        '''
df = pd.read_sql_query(query_3_4, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\1540988719.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

In [11]:
# результат запроса
df

   count
0    294

***

In [12]:
# выводы по предварительному анализу данных

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [13]:
# текст запроса
query_4_1 = f'''select count(vc.id) as cnt, ar.name as area
           FROM public.VACANCIES vc
           left join public.areas ar  on vc.area_id = ar.id
           group by area
           order by cnt desc
           limit 5
           
        '''
df = pd.read_sql_query(query_4_1, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\3939974111.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

In [14]:
# результат запроса
df

    cnt             area
0  5333           Москва
1  2851  Санкт-Петербург
2  2112            Минск
3  2006      Новосибирск
4  1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [15]:
# текст запроса
query_4_2 = f'''select count(vc.id)
           FROM public.VACANCIES vc
           where vc.salary_from > 0 or vc.salary_to > 0
          '''
df = pd.read_sql_query(query_4_2, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\3803728397.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

In [16]:
# результат запроса
df

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [17]:
# текст запроса
query_4_3 = f'''select sum(vc.salary_from::real)/count(vc.salary_from::real) as s_from, sum(vc.salary_to::real)/count(vc.salary_to::real) as s_to
           FROM public.VACANCIES vc
          '''
df = pd.read_sql_query(query_4_3, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\4198692378.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

In [18]:
# результат запроса
df

         s_from          s_to
0  71064.759972  110536.75524

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [19]:
# текст запроса
query_4_4 = f'''select vc.schedule, vc.employment, count(vc.id)
           FROM public.VACANCIES vc
           group by vc.schedule, vc.employment
           order by count desc
          '''
df = pd.read_sql_query(query_4_4, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\1923670554.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

In [20]:
# результат запроса
df

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [21]:
# текст запроса
query_4_5 = f'''select vc.experience, count(vc.id)
           FROM public.VACANCIES vc
           group by vc.experience
           order by count
          '''
df = pd.read_sql_query(query_4_5, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\691044574.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

In [22]:
# результат запроса
df

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [23]:
# выводы по детальному анализу вакансий

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [24]:
# текст запроса
query_5_1 = f'''select emp.id, emp.name, count(vc.id) cnt
           FROM public.EMPLOYERS emp
           left join public.VACANCIES vc on vc.employer_id = emp.id
           group by emp.id, emp.name
           order by cnt desc
           limit 5
        
          '''
df = pd.read_sql_query(query_5_1, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\2929565885.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

In [25]:
# результат запроса
df

      id           name   cnt
0   1740         Яндекс  1933
1   2748     Ростелеком   491
2  78638       Тинькофф   444
3   3529           СБЕР   428
4  39305  Газпром нефть   331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [26]:
# текст запроса 
query_5_2 = f'''select a.name , count(vac.id) count_v, count(emp.id) count_e
from public.areas a 
left join public.vacancies vac ON vac.area_id = a.id
left join public.employers emp ON emp.area = a.id

GROUP BY a.name
having count(vac.id) = 0
order by count_e desc

         
       
          '''
df = pd.read_sql_query(query_5_2, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\1418222017.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

In [27]:
# результат запроса
df

                             name  count_v  count_e
0                          Россия        0      410
1                       Казахстан        0      207
2              Московская область        0       75
3              Краснодарский край        0       19
4              Ростовская область        0       18
..                            ...      ...      ...
588                      Струнино        0        0
589    Славгород (Алтайский край)        0        0
590                     Сорочинск        0        0
591  Ленинский (Тульская область)        0        0
592                         Тавда        0        0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [28]:
# текст запроса
query_5_3 = f'''select emp.id, count(distinct vac.area_id) count_
from public.employers emp  
left join vacancies vac ON vac.employer_id = emp.id

GROUP BY emp.id
order by count_ desc
       
       
          '''
df1 = pd.read_sql_query(query_5_3, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\4176407580.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1 = pd.read_sql_query(query_5_3, connection)

In [29]:
# результат запроса
df1

            id  count_
0         1740     181
1         2748     152
2      5724811     116
3      5130287      88
4      3682876      71
...        ...     ...
23496  5287515       0
23497  2839354       0
23498  5774578       0
23499  5775069       0
23500       15       0

[23501 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [30]:
# текст запроса
query_5_4 = f'''select count(emp.id)
from EMPLOYERS emp
left join public.EMPLOYERS_INDUSTRIES e_i ON e_i.employer_id = emp.id
where e_i.industry_id is null
 
       
          '''
df = pd.read_sql_query(query_5_4, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\1643143037.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

In [31]:
# результат запроса
df

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [32]:
# текст запроса
query_5_5 = f'''select emp.name
from EMPLOYERS emp
left join public.EMPLOYERS_INDUSTRIES e_i ON e_i.employer_id = emp.id

group by emp.name
having count(e_i.industry_id) = 4   
order by   emp.name 
          '''
df = pd.read_sql_query(query_5_5, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\2644853897.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

In [33]:
# результат запроса
df

                 name
0        101 Интернет
1            21vek.by
2                2ГИС
3                  2К
4         4 пикселя +
...               ...
1131            ЮРИОН
1132  ЮТИП Технологии
1133           ЯКласс
1134            ЯрНео
1135    Яшин&Партнёры

[1136 rows x 1 columns]

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [34]:
# текст запроса
query_5_4 = f'''select count(emp.id)
from public.EMPLOYERS_INDUSTRIES e_i
left join public. EMPLOYERS emp ON e_i.employer_id = emp.id
left join INDUSTRIES ind ON e_i.industry_id = ind.id
where ind.name  = 'Разработка программного обеспечения'
 
       
          '''
df = pd.read_sql_query(query_5_4, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\1261246430.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

In [35]:
# результат запроса
df

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [36]:
# код для получения списка городов-милионников

In [37]:
# текст запроса

In [38]:
# результат запроса

***

In [39]:
# выводы по анализу работодателей

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [40]:
# текст запроса
query_6_1 = f'''select count(vac.name)
from vacancies vac
where lower(vac.name) LIKE '%data%' or lower(vac.name) like '%данн%'
 
       
          '''
df = pd.read_sql_query(query_6_1, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\2988044260.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

In [41]:
# результат запроса
df

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [42]:
# текст запроса  where lower(vac.name) IN ('%data%scientist%', '%data%science%', '%исследователь%данных%', '%ml%', '%machine%learning%', '%машинн%обучен%')
query_6_2 = f'''select count(vac.name)
from vacancies vac
where ((lower(vac.name) LIKE '%data%scientist%' OR lower(vac.name) LIKE '%data%science%' OR lower(vac.name) LIKE '%исследователь%данных%' OR lower(vac.name) LIKE '%ml%' OR lower(vac.name) LIKE '%machine%learning%' OR lower(vac.name) LIKE '%машинн%обучен%') AND lower(vac.name) NOT LIKE '%html%') AND
(lower(vac.name) LIKE '%junior%' OR lower(vac.experience) LIKE '%нет%опыта%' OR lower(vac.schedule) LIKE '%стажировка%')

      '''
df = pd.read_sql_query(query_6_2, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\2621591357.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

In [43]:
# результат запроса
df

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [44]:
# текст запроса (lower(vac.key_skills) LIKE '%sql%' OR lower(vac.key_skills) LIKE '%postgres%')
query_6_3 = f'''select count(vac.name)
from vacancies vac
where ((lower(vac.name) LIKE '%data%scientist%' OR lower(vac.name) LIKE '%data%science%' OR lower(vac.name) LIKE '%исследователь%данных%' OR vac.name LIKE '%ML%' OR lower(vac.name) LIKE '%machine%learning%' OR lower(vac.name) LIKE '%машинн%обучен%') AND lower(vac.name) NOT LIKE '%html%')
AND (lower(vac.key_skills) LIKE '%sql%'  OR lower(vac.key_skills) LIKE '%postgres%')
      '''
df = pd.read_sql_query(query_6_3, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\2250504605.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

In [45]:
# результат запроса
df

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [90]:
# текст запроса
query_6_4 = f'''select count(vac.name)
from vacancies vac
where ((lower(vac.name) LIKE '%data%scientist%' OR lower(vac.name) LIKE '%data%science%' OR lower(vac.name) LIKE '%исследователь%данных%' OR vac.name LIKE '%ML%' OR lower(vac.name) LIKE '%machine%learning%' OR lower(vac.name) LIKE '%машинн%обучен%') AND lower(vac.name) NOT LIKE '%html%')
AND (lower(vac.key_skills) LIKE '%python%')
      '''
df = pd.read_sql_query(query_6_4, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\1802849592.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

In [91]:
# результат запроса
df

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [88]:
# текст запроса
query_6_5 = f'''select avg(length(vac.key_skills)+1 - length(replace(vac.key_skills, '\t', '')))
from vacancies vac
where ((lower(vac.name) LIKE '%data%scientist%' OR lower(vac.name) LIKE '%data%science%' OR lower(vac.name) LIKE '%исследователь%данных%' OR vac.name LIKE '%ML%' OR lower(vac.name) LIKE '%machine%learning%' OR lower(vac.name) LIKE '%машинн%обучен%') AND lower(vac.name) NOT LIKE '%html%')


      '''
df = pd.read_sql_query(query_6_5, connection)

C:\Users\Людмила\AppData\Local\Temp\ipykernel_9776\3879622925.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

In [89]:
# результат запроса
df

        avg
0  6.408776

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [ ]:
# текст запроса

In [ ]:
# результат запроса

***

In [ ]:
# выводы по предметному анализу

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования